app/Controllers/AuthController.php

    public function loginAuth()
    {
        $session = session();
        $pemilikRestoranModel = new PemilikRestoran();
        $username = $this->request->getVar('username');
        $password = md5($this->request->getVar('password'));

        $data = $pemilikRestoranModel->where('username', $username)->first();
---
SELECT *
FROM `PemilikRestoran`
WHERE `username` = 'richeese'
 LIMIT 1