app/Controllers/LoginController.php

    public function loginAuth()
    {
        $session = session();
        $customerModel = new PemilikRestoran();
        $username = $this->request->getVar('username');
        $password = md5($this->request->getVar('password'));

        $data = $customerModel->where('username', $username)->first();
---
SELECT *
FROM `Customer`
WHERE `username` = 'user1'
 LIMIT 1