app/Controllers/MenuListController.php

    public function deleteMenu($seg1)
    {
        $menuId = $seg1;

        $db = \Config\Database::connect();

        $db->table('Makanan')->where('id', (int)$menuId)->delete();
---
DELETE FROM `Makanan`
WHERE `id` = 83