app/Models/Makanan.php

    public function getDataMakananbyId($id)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('Makanan');
        $builder->select('Makanan.id, Makanan.nama as namaMakanan, Makanan.harga, Makanan.kalori ,Makanan.waktuProses');
        $builder->where('Makanan.restoranId', (int)$id);
        $query = $builder->get();
---
SELECT `Makanan`.`id`, `Makanan`.`nama` as `namaMakanan`, `Makanan`.`harga`, `Makanan`.`kalori`, `Makanan`.`waktuProses`, `Makanan`.`restoranId`
FROM `Makanan`
WHERE `Makanan`.`restoranId` = 1