app/Models/PemilikRestoran.php

    public function getDataPemilikRestoran()
    {
        return $this->findAll();
---
SELECT *
FROM `PemilikRestoran`

    public function getUserByUsername(string $username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `PemilikRestoran`
WHERE `username` = 'richeese'
 LIMIT 1