app/Models/Restoran.php

    public function getDataRestoran($calorie)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('Restoran');
        $builder->select('Restoran.id, Restoran.nama as namaRestoran, Restoran.lokasiX, Restoran.lokasiY ,Restoran.image, ROUND((sum(Makanan.kalori) / count(Makanan.id)),0) as totalKalori');
        $builder->join('Makanan', 'Restoran.id = Makanan.restoranId');
        $builder->groupBy('Restoran.id');
        if ($calorie !== null) {
            if ($calorie === "Low") {
                $builder->having('totalKalori < 500');
            } else if ($calorie === "Medium") {
                $builder->having('totalKalori >= 500 AND totalKalori <= 800');
            } else if ($calorie === "High") {
                $builder->having('totalKalori > 800');
            }
        }
        $query = $builder->get();
---
SELECT `Restoran`.`id`, `Restoran`.`nama` as `namaRestoran`, `Restoran`.`lokasiX`, `Restoran`.`lokasiY`, `Restoran`.`image`, ROUND((sum(Makanan.kalori) / count(Makanan.id)), 0) as totalKalori
FROM `Restoran`
JOIN `Makanan` ON `Restoran`.`id` = `Makanan`.`restoranId`
GROUP BY `Restoran`.`id`

    public function getDataRestoranbyId($id)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('Restoran');
        $builder->select('Restoran.id, Restoran.nama as namaRestoran, Restoran.lokasiX, Restoran.lokasiY ,Restoran.image, ROUND((sum(Makanan.kalori) / count(Makanan.id)),0) as totalKalori');
        $builder->join('Makanan', 'Restoran.id = Makanan.restoranId');
        $builder->groupBy('Restoran.id');
        $builder->having('Restoran.id', (int)$id);
        $query = $builder->get();
---
SELECT `Restoran`.`id`, `Restoran`.`nama` as `namaRestoran`, `Restoran`.`lokasiX`, `Restoran`.`lokasiY`, `Restoran`.`image`, ROUND((sum(Makanan.kalori) / count(Makanan.id)), 0) as totalKalori
FROM `Restoran`
JOIN `Makanan` ON `Restoran`.`id` = `Makanan`.`restoranId`
GROUP BY `Restoran`.`id`
HAVING `Restoran`.`id` = 4